kirakiseki/ECGMonitor-XiUOS/xiuos/Ubiquitous/Nuttx_Fusion_XiUOS/aiit_board/xidatong-riscv64/src/k210_ch438.c
    k210_gpiohs_set_value(FPIOA_CH438_ALE, false);
    up_udelay(1);        

    CH438SetInput();
    up_udelay(1);
    
    k210_gpiohs_set_value(FPIOA_CH438_NRD, false);
    up_udelay(1);    
    
    if (k210_gpiohs_get_value(FPIOA_CH438_D7))    dat |= 0x80;
    if (k210_gpiohs_get_value(FPIOA_CH438_D6))    dat |= 0x40;
    if (k210_gpiohs_get_value(FPIOA_CH438_D5))    dat |= 0x20;
    if (k210_gpiohs_get_value(FPIOA_CH438_D4))    dat |= 0x10;
    if (k210_gpiohs_get_value(FPIOA_CH438_D3))    dat |= 0x08;
    if (k210_gpiohs_get_value(FPIOA_CH438_D2))    dat |= 0x04;
    if (k210_gpiohs_get_value(FPIOA_CH438_D1))    dat |= 0x02;
    if (k210_gpiohs_get_value(FPIOA_CH438_D0))    dat |= 0x01;
    
    k210_gpiohs_set_value(FPIOA_CH438_NRD, true);
    k210_gpiohs_set_value(FPIOA_CH438_ALE, true);
    up_udelay(1);

    return dat;
}

/****************************************************************************
 * Name: WriteCH438Data
 *
 * Description:
 *   write data to ch438 address
 *
 ****************************************************************************/
static void WriteCH438Data(uint8_t addr, const uint8_t dat)
{
    k210_gpiohs_set_value(FPIOA_CH438_ALE, true);
    k210_gpiohs_set_value(FPIOA_CH438_NRD, true);
    k210_gpiohs_set_value(FPIOA_CH438_NWR, true);

    CH438SetOutput();
    up_udelay(1);    
    
    if(addr &0x80)    k210_gpiohs_set_value(FPIOA_CH438_D7, true);    else    k210_gpiohs_set_value(FPIOA_CH438_D7, false);
    if(addr &0x40)    k210_gpiohs_set_value(FPIOA_CH438_D6, true);    else    k210_gpiohs_set_value(FPIOA_CH438_D6, false);
    if(addr &0x20)    k210_gpiohs_set_value(FPIOA_CH438_D5, true);    else    k210_gpiohs_set_value(FPIOA_CH438_D5, false);
    if(addr &0x10)    k210_gpiohs_set_value(FPIOA_CH438_D4, true);    else    k210_gpiohs_set_value(FPIOA_CH438_D4, false);
    if(addr &0x08)    k210_gpiohs_set_value(FPIOA_CH438_D3, true);    else    k210_gpiohs_set_value(FPIOA_CH438_D3, false);
    if(addr &0x04)    k210_gpiohs_set_value(FPIOA_CH438_D2, true);    else    k210_gpiohs_set_value(FPIOA_CH438_D2, false);
    if(addr &0x02)    k210_gpiohs_set_value(FPIOA_CH438_D1, true);    else    k210_gpiohs_set_value(FPIOA_CH438_D1, false);
    if(addr &0x01)    k210_gpiohs_set_value(FPIOA_CH438_D0, true);    else    k210_gpiohs_set_value(FPIOA_CH438_D0, false);

    up_udelay(1);    
    
    k210_gpiohs_set_value(FPIOA_CH438_ALE, false);
    up_udelay(1);

    if(dat &0x80)    k210_gpiohs_set_value(FPIOA_CH438_D7, true);    else    k210_gpiohs_set_value(FPIOA_CH438_D7, false);
    if(dat &0x40)    k210_gpiohs_set_value(FPIOA_CH438_D6, true);    else    k210_gpiohs_set_value(FPIOA_CH438_D6, false);
    if(dat &0x20)    k210_gpiohs_set_value(FPIOA_CH438_D5, true);    else    k210_gpiohs_set_value(FPIOA_CH438_D5, false);
    if(dat &0x10)    k210_gpiohs_set_value(FPIOA_CH438_D4, true);    else    k210_gpiohs_set_value(FPIOA_CH438_D4, false);
    if(dat &0x08)    k210_gpiohs_set_value(FPIOA_CH438_D3, true);    else    k210_gpiohs_set_value(FPIOA_CH438_D3, false);
    if(dat &0x04)    k210_gpiohs_set_value(FPIOA_CH438_D2, true);    else    k210_gpiohs_set_value(FPIOA_CH438_D2, false);
    if(dat &0x02)    k210_gpiohs_set_value(FPIOA_CH438_D1, true);    else    k210_gpiohs_set_value(FPIOA_CH438_D1, false);
    if(dat &0x01)    k210_gpiohs_set_value(FPIOA_CH438_D0, true);    else    k210_gpiohs_set_value(FPIOA_CH438_D0, false);
    
    up_udelay(1);    

    k210_gpiohs_set_value(FPIOA_CH438_NWR, false);
    up_udelay(1);    
    
    k210_gpiohs_set_value(FPIOA_CH438_NWR, true);
    k210_gpiohs_set_value(FPIOA_CH438_ALE, true);
    up_udelay(1);    

    CH438SetInput();

    return;
}

/****************************************************************************
 * Name: WriteCH438Block
 *
 * Description:
 *   Write data block from ch438 address
 *
 ****************************************************************************/
static void WriteCH438Block(uint8_t mAddr, uint8_t mLen, const uint8_t *mBuf)
{
    while(mLen--)
        WriteCH438Data(mAddr, *mBuf++);
}

/****************************************************************************
 * Name: CH438UARTSend
 *
 * Description:
 *   Enable FIFO mode, which is used for ch438 serial port to send multi byte data,
 *   with a maximum of 128 bytes of data sent at a time
 *
 ****************************************************************************/
static void Ch438UartSend(uint8_t ext_uart_no, const uint8_t *Data, uint16_t Num)
{
    uint8_t REG_LSR_ADDR,REG_THR_ADDR;
    REG_LSR_ADDR = offsetadd[ext_uart_no] | REG_LSR0_ADDR;
    REG_THR_ADDR = offsetadd[ext_uart_no] | REG_THR0_ADDR;
    
    while(1)
    {
        while((ReadCH438Data(REG_LSR_ADDR) & BIT_LSR_TEMT) == 0); /* wait for sending data done, THR and TSR is NULL */
        if(Num <= 128)
        {
            WriteCH438Block(REG_THR_ADDR, Num, Data);
            break;
        }
        else
        {
            WriteCH438Block(REG_THR_ADDR, 128, Data);
            Num -= 128;
            Data += 128;
        }
    }
}

/****************************************************************************
 * Name: CH438UARTRcv
 *
 * Description:
 *   Disable FIFO mode for ch438 serial port to receive multi byte data
 *
 ****************************************************************************/
uint8_t CH438UARTRcv(uint8_t ext_uart_no, uint8_t *buf, size_t size)
{
    uint8_t rcv_num = 0;
    uint8_t dat = 0;
    uint8_t REG_LSR_ADDR,REG_RBR_ADDR;
    uint8_t *read_buffer;
    size_t buffer_index = 0;

    read_buffer = buf;

    REG_LSR_ADDR = offsetadd[ext_uart_no] | REG_LSR0_ADDR;
    REG_RBR_ADDR = offsetadd[ext_uart_no] | REG_RBR0_ADDR;

    /* Wait for the data to be ready */	
    while ((ReadCH438Data(REG_LSR_ADDR) & BIT_LSR_DATARDY) == 0);

    while (((ReadCH438Data(REG_LSR_ADDR) & BIT_LSR_DATARDY) == 0x01) && (size != 0))
    {
        dat = ReadCH438Data(REG_RBR_ADDR);
        *read_buffer = dat;
        read_buffer++;
        buffer_index++;
        if (255 == buffer_index) {
            buffer_index = 0;
            read_buffer = buf;
        }

        ++rcv_num;
        --size;
    }

