kirakiseki/ECGMonitor-XiUOS/xiuos/Ubiquitous/Nuttx_Fusion_XiUOS/aiit_board/xidatong-riscv64/src/k210_ch438.c
        ret = pthread_mutex_init(&mutex[i], NULL);
        if(ret != 0)
        {
            ch438err("pthread_mutex_init failed, status=%d\n", ret);
        }
    }

    /* Initialize the condition variable */
    for(i = 0; i < CH438PORTNUM; i++)
    {
        if(!g_uart_selected[i])
        {
            continue;
        }
        
        ret = pthread_cond_init(&cond[i], NULL);
        if(ret != 0)
        {
            ch438err("pthread_cond_init failed, status=%d\n", ret);
        }
    }

    ch438_io_config();
    K210CH438Init();

/* If a port is checked, the port will be initialized. Otherwise, the interrupt of the port will be disabled. */

#ifdef CONFIG_CH438_EXTUART0
    CH438PortInit(0, CONFIG_CH438_EXTUART0_BAUD);
#else
    WriteCH438Data(REG_IER0_ADDR, 0x00);
#endif

#ifdef CONFIG_CH438_EXTUART1
    CH438PortInit(1, CONFIG_CH438_EXTUART1_BAUD);
#else
    WriteCH438Data(REG_IER1_ADDR, 0x00);
#endif

#ifdef CONFIG_CH438_EXTUART2
    CH438PortInit(2, CONFIG_CH438_EXTUART2_BAUD);
#else
    WriteCH438Data(REG_IER2_ADDR, 0x00);
#endif

#ifdef CONFIG_CH438_EXTUART3
    CH438PortInit(3, CONFIG_CH438_EXTUART3_BAUD);
#else
    WriteCH438Data(REG_IER3_ADDR, 0x00);
#endif

#ifdef CONFIG_CH438_EXTUART4
    CH438PortInit(4, CONFIG_CH438_EXTUART4_BAUD);
#else
    WriteCH438Data(REG_IER4_ADDR, 0x00);
#endif

#ifdef CONFIG_CH438_EXTUART5
    CH438PortInit(5, CONFIG_CH438_EXTUART5_BAUD);
#else
    WriteCH438Data(REG_IER5_ADDR, 0x00);
#endif

#ifdef CONFIG_CH438_EXTUART6
    CH438PortInit(6, CONFIG_CH438_EXTUART6_BAUD);
#else
    WriteCH438Data(REG_IER6_ADDR, 0x00);
#endif

#ifdef CONFIG_CH438_EXTUART7
    CH438PortInit(7, CONFIG_CH438_EXTUART7_BAUD);
#else
    WriteCH438Data(REG_IER7_ADDR, 0x00);
#endif

    up_mdelay(10);

    work_queue(HPWORK, &g_ch438irqwork, getInterruptStatus, NULL, CH438_INCREMENT);
}

/****************************************************************************
 * Name: ch438_open
 ****************************************************************************/
static int ch438_open(FAR struct file *filep)
{
    FAR struct inode *inode = filep->f_inode;
    FAR struct ch438_dev_s *priv = inode->i_private;
    uint8_t port = priv->port;
    int ret = OK;

    DEBUGASSERT(port >= 0 && port < CH438PORTNUM);

    ret = nxsem_wait_uninterruptible(&priv->devsem);
    if (ret < 0)
    {
        return ret;
    }

    if(g_ch438open[port])
    {
        ch438err("ERROR: ch438 port %d is opened!\n",port);
        return -EBUSY;
    }
    g_ch438open[port] = true;

    nxsem_post(&priv->devsem);

    return ret;
}

/****************************************************************************
 * Name: ch438_close
 ****************************************************************************/
static int ch438_close(FAR struct file *filep)
{
    FAR struct inode *inode = filep->f_inode;
    FAR struct ch438_dev_s *priv = inode->i_private;
    uint8_t port = priv->port;
    int ret = OK;

    DEBUGASSERT(port >= 0 && port < CH438PORTNUM);

    ret = nxsem_wait_uninterruptible(&priv->devsem);
    if (ret < 0)
    {
        return ret;
    }

    if(!g_ch438open[port])
    {
        ch438err("ERROR: ch438 port %d is closed!\n",port);
        return -EBUSY;
    }
    g_ch438open[port] = false;

    nxsem_post(&priv->devsem);
    return ret;
}

/****************************************************************************
 * Name: ch438_read
 ****************************************************************************/
static ssize_t ch438_read(FAR struct file *filep, FAR char *buffer, size_t buflen)
{
    size_t length = 0;
    FAR struct inode *inode = filep->f_inode;
    FAR struct ch438_dev_s *priv = inode->i_private;
    uint8_t port = priv->port;

    DEBUGASSERT(port >= 0 && port < CH438PORTNUM);

    length = K210Ch438ReadData(port, buflen);
    memcpy(buffer, buff[port], length);

    if(length > buflen)
    {
        length = buflen;
    }

    return length;
}

/****************************************************************************
 * Name: ch438_write
 ****************************************************************************/
static ssize_t ch438_write(FAR struct file *filep, FAR const char *buffer, size_t buflen)
{
    FAR struct inode *inode = filep->f_inode;
    FAR struct ch438_dev_s *priv = inode->i_private;
    uint8_t port = priv->port;

    DEBUGASSERT(port >= 0 && port < CH438PORTNUM);

    K210Ch438WriteData(port, (const uint8_t *)buffer, buflen);
    
    return buflen;
}

/****************************************************************************
 * Name: ch438_ioctl
 ****************************************************************************/
static int ch438_ioctl(FAR struct file *filep, int cmd, unsigned long arg)
{
    FAR struct inode *inode = filep->f_inode;
    FAR struct ch438_dev_s *priv = inode->i_private;
    uint8_t port = priv->port;
    int ret = OK;

    DEBUGASSERT(port >= 0 && port < CH438PORTNUM);

    switch(cmd)
    {
        case OPE_INT:
        case OPE_CFG:
            CH438PortInit(port, (uint32_t)arg);
            break;

        default:
            ch438info("Unrecognized cmd: %d\n", cmd);
            ret = -ENOTTY;
            break;
    }
    return ret;
}


/****************************************************************************
 * Name: ch438_register
 *
 * Description:
 *   Register /dev/ext_uartN
 *
 ****************************************************************************/
static int ch438_register(FAR const char *devpath, uint8_t port)
{
    FAR struct ch438_dev_s *priv;
    int ret = 0;

    /* port number check */
    DEBUGASSERT(port >= 0 && port < CH438PORTNUM);

    priv = (FAR struct ch438_dev_s *)kmm_malloc(sizeof(struct ch438_dev_s));
    if(priv == NULL)
    {
        ch438err("ERROR: Failed to allocate instance\n");
        return -ENOMEM;
    }

    priv->port = port;
    nxsem_init(&priv->devsem, 0, 1);

    /* Register the character driver */
    ret = register_driver(devpath, &g_ch438fops, 0666, priv);
    if(ret < 0)
    {
        kmm_free(priv);
    }
    
    return ret;
}

/****************************************************************************
 * Name: board_ch438_initialize
 *
 * Description:
 *   ch438 initialize
 *
 ****************************************************************************/
void board_ch438_initialize(void)
{
    Ch438InitDefault();

#ifdef CONFIG_CH438_EXTUART0
    ch438_register("/dev/extuart_dev0", 0);
#endif

#ifdef CONFIG_CH438_EXTUART1
    ch438_register("/dev/extuart_dev1", 1);
#endif

#ifdef CONFIG_CH438_EXTUART2
    ch438_register("/dev/extuart_dev2", 2);
#endif

#ifdef CONFIG_CH438_EXTUART3
    ch438_register("/dev/extuart_dev3", 3);
#endif

#ifdef CONFIG_CH438_EXTUART4
    ch438_register("/dev/extuart_dev4", 4);
#endif

#ifdef CONFIG_CH438_EXTUART5
    ch438_register("/dev/extuart_dev5", 5);
#endif

#ifdef CONFIG_CH438_EXTUART6
    ch438_register("/dev/extuart_dev6", 6);
#endif

#ifdef CONFIG_CH438_EXTUART7
    ch438_register("/dev/extuart_dev7", 7);
#endif
}